results/hey_20260601_143951.txt
=== hey load test ===
Target: http://localhost:8000/predict
Duration: 30s, Concurrency: 50


Summary:
  Total:	30.0499 secs
  Slowest:	0.3072 secs
  Fastest:	0.0236 secs
  Average:	0.0701 secs
  Requests/sec:	713.1802
  
  Total data:	2743365 bytes
  Size/request:	128 bytes

Response time histogram:
  0.024 [1]	|
  0.052 [2705]	|■■■■■■■
  0.080 [14598]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.109 [3120]	|■■■■■■■■■
  0.137 [675]	|■■
  0.165 [178]	|
  0.194 [52]	|
  0.222 [16]	|
  0.251 [38]	|
  0.279 [29]	|
  0.307 [19]	|


Latency distribution:
  10%% in 0.0502 secs
  25%% in 0.0576 secs
  50%% in 0.0659 secs
  75%% in 0.0766 secs
  90%% in 0.0921 secs
  95%% in 0.1077 secs
  99%% in 0.1513 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0055 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.0700 secs, 0.0235 secs, 0.3072 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [200]	21431 responses



=== Application metrics (after load) ===
# HELP inference_requests_total Total HTTP requests handled
# TYPE inference_requests_total counter
inference_requests_total 21435
# HELP inference_predictions_total Total predictions served
# TYPE inference_predictions_total counter
inference_predictions_total 21433
# HELP inference_cache_hits_total Total cache hits
# TYPE inference_cache_hits_total counter
inference_cache_hits_total 21421
# HELP inference_cache_hit_rate Cache hit rate
# TYPE inference_cache_hit_rate gauge
inference_cache_hit_rate 0.999440
# HELP inference_latency_ms_avg Average prediction latency in ms
# TYPE inference_latency_ms_avg gauge
inference_latency_ms_avg 4.9501